# Вручную создайте список с целыми числами, которые повторяются.
# Получите новый список, который содержит уникальные (без повтора) элементы исходного списка.
# *Подготовьте два решения, короткое и длинное, которое не использует другие коллекции помимо списков.
# import random
#
# data = [random.randint(1, 10) for i in range(50)]
# print(data)
#
# res_1 = list(set(data))
# print(res_1)
#
# res_2 = []
#
# for i in data:
#     if i not in res_2:
#         res_2.append(i)
#
# print(sorted(res_2))


# Пользователь вводит данные. Сделайте проверку данных и преобразуйте если возможно в один из вариантов ниже:
# ● целое положительное число
# ● вещественное положительное или отрицательное число
# ● строку в нижнем регистре, если в строке есть хотя бы одна заглавная буква
# ● строку в верхнем регистре в остальных случаях


