# Методы upper, lower, title, capitalize
# При работе с текстом можно быстро менять строчные буквы на прописные и
# наоборот.
# 24
# text = 'однажды в СТУДЁНУЮ зИмнЮЮ ПоРУ'
# print(text.upper())
# print(text.lower())
# print(text.title())
# print(text.capitalize())
# ● upper — все символы приводятся к верхнему регистру
# ● lower — все символы приводятся к нижнему регистру
# ● title — первый символ каждого слова (разделитель слов - пробел) приводится
# к верхнему регистру, остальные символы к нижнему
# ● capitalize — первый символ строки в верхнем регистре, остальные в нижнем