# Создайте модуль с функцией внутри.
# Функция получает на вход загадку, список с возможными вариантами отгадок и количество попыток на угадывание.
# Программа возвращает номер попытки, с которой была отгадана загадка или ноль, если попытки исчерпаны.

def guess_answer(question: str, answers: list[str], tries: int) -> int:
    for i in range(tries):
        print(question)
    answer = input("Введите ваш ответ: ")
    if answer in answers:
        return i + 1
    return 0

# Добавьте в модуль с загадками функцию, которая хранит словарь списков.
# Ключ словаря - загадка, значение - список с отгадками.
# Функция в цикле вызывает загадывающую функцию, чтобы передать ей все свои загадки.