# Функции chr(), ord()
# Рассмотрим пару функций для работе со символами и их кодами в Юникод.
#
# ● Функция chr()
#
# chr(integer)
# Функция возвращает строковой символ из таблицы Юникод по его номеру. Номер -
# целое число от 0 до 1_114_111.
# print(chr(97))
# print(chr(1105))
# print(chr(128519))
#
#
# ● Функция ord()
# ord(char)
# Функция принимает один символ и возвращает его код в таблице Юникод.
# print(ord('a'))
# print(ord('а'))
# print(ord('😉'))
# Функции ord и chr выполняют противоположные действия.
